In [1]:
import sys
import os
project_root = os.path.abspath(os.path.join(os.getcwd(), '..'))
if project_root not in sys.path:
    sys.path.append(project_root)
from config import *
import pandas as pd
pd.options.display.max_columns = None
import numpy as np

In [9]:
data = pd.read_csv(os.path.join(DATA_RAW_DIR, 'prueba.csv'), sep = ';')
data.shape

(25296, 4)

### Postgresql

In [ ]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

engine = create_engine('postgresql://admin:admin123@localhost:5432/testdb')
data.to_sql('tabla_estudiantes', con=engine, index=False, if_exists='replace', chunksize=1000, method='multi')
print("✅ Tabla creada exitosamente en PostgreSQL.")

✅ Tabla creada exitosamente en PostgreSQL.

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

engine_pg = create_engine('postgresql+psycopg2://admin:admin123@localhost:5432/testdb')

with open(os.path.join(SCRIPTS_QUERIES_DIR, 'consulta_prueba.sql'), 'r', encoding='utf-8') as file:
        query = file.read()
#query = "SELECT * FROM tabla_estudiantes WHERE edad >= 20"

df_pg = pd.read_sql(query, con=engine_pg)
df_pg

         id       nombres  edad  notas
0         3      nombre 3    20      8
1        12     nombre 12    20      4
2        34     nombre 34    20     20
3        49     nombre 49    20     15
4        75     nombre 75    20     11
...     ...           ...   ...    ...
2301  25252  nombre 25252    20     13
2302  25255  nombre 25255    20      7
2303  25263  nombre 25263    20      7
2304  25268  nombre 25268    20     20
2305  25289  nombre 25289    20     13

[2306 rows x 4 columns]

### Mysql

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://admin:admin1234@localhost:3306/testdb_mysql')
data.to_sql('tabla_estudiantes', con=engine, index=False, if_exists='replace', chunksize=1000, method='multi')
print("✅ Tabla creada exitosamente en MySQL.")

✅ Tabla creada exitosamente en MySQL.

In [18]:
import pandas as pd
from sqlalchemy import create_engine

engine_mysql = create_engine('mysql+pymysql://admin:admin1234@localhost:3306/testdb_mysql')

with open(os.path.join(SCRIPTS_QUERIES_DIR, 'consulta_prueba.sql'), 'r', encoding='utf-8') as file:
        query = file.read()

#query = "SELECT * FROM tabla_estudiantes WHERE edad >= 20"

df_mysql = pd.read_sql(query, con=engine_mysql)
df_mysql

         id       nombres  edad  notas
0         3      nombre 3    20      8
1        12     nombre 12    20      4
2        34     nombre 34    20     20
3        49     nombre 49    20     15
4        75     nombre 75    20     11
...     ...           ...   ...    ...
2301  25252  nombre 25252    20     13
2302  25255  nombre 25255    20      7
2303  25263  nombre 25263    20      7
2304  25268  nombre 25268    20     20
2305  25289  nombre 25289    20     13

[2306 rows x 4 columns]